yosys read_verilog -sv sv2v_out.v
yosys hierarchy -top cellift_scarv
yosys proc
yosys opt
yosys connectionlist_with_mods
yosys write_rtlil scarv_ctree_rtlil.txt